"CIAdditionCompositing" = "Adds color components to achieve a brightening effect. This filter is typically used to add highlights and lens flare effects.";"CIAffineClamp" = "Performs an affine transform on a source image and then clamps the pixels at the edge of the transformed image, extending them outwards. This filter performs similarly to the CIAffineTransform filter except that it produces an image with infinite extent. You can use this filter when you need to blur an image but you want to avoid a soft, black fringe along the edges.";"CIAffineTile" = "Applies an affine transform to an image and then tiles the transformed image.";"CIAffineTransform" = "Applies an affine transform to an image. You can scale, translate, or rotate the input image. You can also apply a combination of these operations.";"CIBarsSwipeTransition" = "Transitions from one image to another by swiping rectangular portions of the foreground image to disclose the target image.";"CIBlendWithMask" = "Uses values from a grayscale mask to interpolate between an image and the background. When a mask value is 0.0, the result is the background. When the mask value is 1.0, the result is the image.";"CIBloom" = "Softens edges and applies a pleasant glow to an image.";"CIBoxBlur" = "Smooths or sharpens an image using a box-shaped convolution kernel.";"CIBumpDistortion" = "Creates a concave or convex bump that originates at a specified point in the image.";"CIBumpDistortionLinear" = "Creates a bump that originates from a linear portion of the image.";"CICMYKHalftone" = "Creates a color, halftoned rendition of the source image, using cyan, magenta, yellow, and black inks over a white page.";"CICheckerboardGenerator" = "Generates a checkerboard pattern. You can specify the checkerboard size and colors, and the sharpness of the pattern.";"CICircleSplashDistortion" = "Distorts the pixels starting at the circumference of a circle and emanating outward.";"CICircularScreen" = "Simulates a circular-shaped halftone screen.";"CICircularWrap" = "Wraps an image around a transparent circle. The distortion of the image increases with the distance from the center of the circle.";"CIColorControls" = "Adjusts saturation, brightness, and contrast values.";"CIColorCube" = "Uses a three-dimensional color table to transform the source image pixels. The color table must be  composed of floating-point RGBA cells that use premultiplied alpha. The cells are organized in a standard ordering. The columns and rows of the data are indexed by red and green, respectively. Each data plane is followed by the next higher plane in the data, with planes indexed by blue.";"CIColorInvert" = "Inverts the colors in an image.";"CIColorMap" = "Performs a nonlinear transformation of source color values using mapping values provided in a table.";"CIColorMatrix" = "Multiplies source color values and adds a bias factor to each color component.";"CIColorMonochrome" = "Remaps colors so they fall within shades of a single color.";"CIColorPosterize" = "Remaps red, green, and blue color components to the number of brightness values you specify for each color component. This filter flattens colors to achieve a look similar to that of a silk-screened poster.";"CIComicEffect" = "Simulates a comic book drawing by outlining edges and applying a color halftone effect.";"CIConstantColorGenerator" = "Generates a solid color. You typically use the output of this filter as the input to another filter.";"CICopyMachineTransition" = "Transitions from one image to another by simulating the effect of a copy machine.";"CICrop" = "Applies a crop to an image. The size and shape of the cropped image depend on the rectangle you specify.";"CICrystallize" = "Creates polygon-shaped color blocks by aggregating source pixel-color values.";"CIDiscBlur" = "Smooths or sharpens an image using a disc-shaped convolution kernel.";"CIDisintegrateWithMaskTransition" = "Transitions from one image to another using the shape defined by a mask.";"CIDisplacementDistortion" = "Applies the grayscale values of the second image to the first image. The output image has a texture defined by the grayscale values.";"CIDissolveTransition" = "Uses a dissolve to transition from one image to another.";"CIDotScreen" = "Simulates the dot patterns of a halftone screen.";"CIEdges" = "Finds all edges in an image and displays them in color.";"CIEdgeWork" = "Produces a stylized black-and-white rendition of an image that looks similar to a woodblock cutout.";"CIEightfoldReflectedTile" = "Produces a tiled image from a source image by applying an 8-way reflected symmetry.";"CIExposureAdjust" = "Adjusts the exposure setting for an image similar to the way you control exposure for a camera when you change the F-stop.";"CIFalseColor" = "Maps luminance to a color ramp of two colors. False color is often used to process astronomical and other scientific data, such as ultraviolet and x-ray images.";"CIFastBoxBlur" = "Smooths or sharpens an image using a box-shaped convolution kernel.";"CIFastDiscBlur" = "Smooths or sharpens an image using a disc-shaped convolution kernel.";"CIFlashTransition" = "Transitions from one image to another by creating a flash. The flash originates from a point you specify. Small at first, it rapidly expands until the image frame is completely filled with the flash color. As the color fades, the target image begins to appear.";"CIFourfoldReflectedTile" = "Produces a tiled image from a source image by applying a 4-way reflected symmetry.";"CIFourfoldRotatedTile" = "Produces a tiled image from a source image by rotating the source at increments of 90 degrees.";"CIFourfoldTranslatedTile" = "Produces a tiled image from a source image by applying 4 translation operations.";"CIGammaAdjust" = "Adjusts midtone brightness. This filter is typically used to compensate for nonlinear effects of displays. Adjusting the gamma effectively changes the slope of the transition between black and white.";"CIGaussianBlur" = "Spreads source pixels by an amount specified by a Gaussian distribution.";"CIGaussianGradient" = "Generates a gradient that varies from one color to another using a Gaussian distribution.";"CIGlassDistortion" = "Distorts an image by applying a glass-like texture. The raised portions of the output image are the result of applying a texture map.";"CIGlassLozenge" = "Creates a lozenge-shaped lens and distorts the portion of the image over which the lens is placed.";"CIGlideReflectedTile" = "Produces a tiled image from a source image by translating and smearing the image.";"CIGloom" = "Dulls the highlights of an image.";"CIHatchedScreen" = "Simulates the hatched pattern of a halftone screen.";"CIHeightFieldFromMask" = "Produces a continuous three-dimensional, loft-shaped height field from a grayscale mask. The white values of the mask define those pixels that are inside the height field while the black values define those pixels that are outside. The field varies smoothly and continuously inside the mask, reaching the value 0 at the edge of the mask. You can use this filter with the CIShadedMaterial filter to produce extremely realistic shaded objects.";"CIHexagonalPixellate" = "Displays an image as colored hexagons whose color is an average of the pixels they replace.";"CIHoleDistortion" = "Creates a circular area that pushes the image pixels outward, distorting those pixels closest to the circle the most.";"CIHueAdjust" = "Changes the overall hue, or tint, of the source pixels.";"CIKaleidoscope" = "Produces a kaleidoscopic image from a source image by applying 12-way symmetry.";"CILanczosScaleTransform" = "Produces a high-quality, scaled version of a source image. You typically use this filter to scale down an image.";"CILenticularHaloGenerator" = "Simulates a halo that is generated by the diffraction associated with the spread of a lens. This filter is typically applied to another image to simulate lens flares and similar effects.";"CILineOverlay" = "Creates a sketch that outlines the edges of an image in black, leaving the non-outlined portions of the image transparent. The result has alpha and is rendered in black, so it won't look like much until you render it over another image using source over compositing.";"CILineScreen" = "Simulates the line pattern of a halftone screen.";"CILinearGradient" = "Generates a gradient that varies along a linear axis between two defined endpoints.";"CIMaskToAlpha" = "Converts a grayscale image to a white image that is masked by alpha. The white values from the source image produce the inside of the mask; the black values become completely transparent.";"CIMaximumCompositing" = "Computes the maximum value, by color component, of two input images and creates an output image using the maximum values. This is similar to dodging.";"CIMedianFilter" = "Computes the median value for a group of neighboring pixels and replaces each pixel value with the median. The effect is to reduce noise.";"CIMinimumCompositing" = "Computes the minimum value, by color component, of two input images and creates an output image using the minimum values. This is similar to burning.";"CIModTransition" = "Transitions from one image to another by revealing the target image through irregularly shaped holes.";"CIMotionBlur" = "Blurs an image to simulate the effect of using a camera that moves a specified angle and distance while capturing the image.";"CIMultiplyCompositing" = "Multiplies the color component of two input images and creates an output image using the multiplied values. This filter is typically used to add a spotlight or similar lighting effect to an image.";"CINoiseReduction" = "Reduces noise using a threshold value to define what is considered noise. Small changes in luminance below that value are considered noise and get a noise reduction treatment, which is a local blur. Changes above the threshold value are considered edges, so they are sharpened.";"CIOpTile" = "Segments an image, applying any specified scaling and rotation, and then assembles the image again to give an op art appearance.";"CIPageCurlTransition" = "Transitions from one image to another by simulating a curling page, revealing the new image as the page curls.";"CIParallelogramTile" = "Warps an image by reflecting it in a parallelogram, and then tiles the result.";"CIPerspectiveTile" = "Applies a perspective transform to an image and then tiles the result.";"CIPerspectiveTransform" = "Alters the geometry of an image to simulate the observer changing viewing position. You can use the perspective filter to skew an image.";"CIPinchDistortion" = "Creates a rectangular-shaped area that pinches source pixels inward, distorting those pixels closest to the rectangle the most.";"CIPixellate" = "Makes an image blocky.";"CIPointillize" = "Renders the source image in a pointillistic style.";"CIRadialGradient" = "Generates a gradient that varies radially between two circles having the same center. It is valid for one of the two circles to have a radius of 0.";"CIRandomGenerator" = "Generates an image of infinite extent whose pixel values are made up of four independent, uniformly-distributed random numbers in the 0 to 1 range.";"CIRippleTransition" = "Transitions from one image to another by creating a circular wave that expands from the center point, revealing the new image in the wake of the wave.";"CISepiaTone" = "Maps the colors of an image to various shades of brown.";"CIShadedMaterial" = "Produces a shaded image from a height field. The height field is defined to have greater heights with lighter shades, and lesser heights (lower areas) with darker shades. You can combine this filter with the CIHeightFieldFromMask filter to produce quick shadings of masks, such as text.";"CISharpenLuminance" = "Increases image detail by sharpening. It operates on the luminance of the image; the chrominance of the pixels remains unaffected.";"CISixfoldReflectedTile" = "Produces a tiled image from a source image by applying a 6-way reflected symmetry.";"CISixfoldRotatedTile" = "Produces a tiled image from a source image by rotating the source at increments of 60 degrees.";"CISourceAtopCompositing" = "Places the source image over the background image, then uses the luminance of the background image to determine what to show. The composite shows the background image and only those portions of the source image that are over visible parts of the background.";"CISourceInCompositing" = "Uses the second image to define what to leave in the source image, effectively cropping the image.";"CISourceOutCompositing" = "Uses the second image to define what to take out of the first image.";"CISourceOverCompositing" = "Places the second image over the first.";"CISpotColor" = "Replaces one ore more color ranges with spot colors.";"CISpotLight" = "Applies a directional spotlight effect to an image.";"CIStarShineGenerator" = "Generates a starburst pattern. The output image is typically used as input to another filter";"CIStripesGenerator" = "Generates a stripe pattern. You can control the color of the stripes, the spacing, and the contrast.";"CISunbeamsGenerator" = "Generates a sun effect. You typically use the output of the sunbeams filter as input to a composite filter.";"CISwipeTransition" = "Transitions from one image to another by simulating a swiping action.";"CITorusLensDistortion" = "Creates a torus-shaped lens and distorts the portion of the image over which the lens is placed.";"CITriangleTile" = "Maps a triangular portion of image to a triangular area and then tiles the result.";"CITwelvefoldReflectedTile" = "Produces a tiled image from a source image by applying a 12-way reflected symmetry.";"CITwirlDistortion" = "Rotates pixels around a point to give a twirling effect. You can specify the number of rotations as well as the center and radius of the effect.";"CIUnsharpMask" = "Increases the contrast of the edges between pixels of different colors in an image.";"CIVortexDistortion" = "Rotates pixels around a point to simulate a vortex. You can specify the number of rotations as well the center and radius of the effect. ";"CIWhitePointAdjust" = "Adjusts the reference white point for an image and maps all colors in the source using the new reference.";"CIZoomBlur" = "Simulates the effect of zooming the camera while capturing the image.";"CIColorBlendMode" = "Uses the luminance values of the background with the hue and saturation values of the source image. This mode preserves the gray levels in the image.";"CIColorBurnBlendMode" = "Darkens the background image samples to reflect the source image samples. Source image sample values that specify white do not produce a change.";"CIColorDodgeBlendMode" = "Brightens the background image samples to reflect the source image samples. Source image sample values that specify black do not produce a change.";"CIDarkenBlendMode" = "Creates composite image samples by choosing the darker samples (from either the source image or the background). The result is that the background image samples are replaced by any source image samples that are darker. Otherwise, the background image samples are left unchanged.";"CIDifferenceBlendMode" = "Subtracts either the source image sample color from the background image sample color, or the reverse, depending on which sample has the greater brightness value. Source image sample values that are black produce no change; white inverts the background color values.";"CIExclusionBlendMode" = "Produces an effect similar to that produced by the CIDifferenceBlendMode filter but with lower contrast. Source image sample values that are black do not produce a change; white inverts the background color values.";"CIHardLightBlendMode" = "Either multiplies or screens colors, depending on the source image sample color. If the source image sample color is lighter than 50% gray, the background is lightened, similar to screening. If the source image sample color is darker than 50% gray, the background is darkened, similar to multiplying. If the source image sample color is equal to 50% gray, the source image is not changed. Image samples that are equal to pure black or pure white result in pure black or white. The overall effect is similar to what you would achieve by shining a harsh spotlight on the source image.";"CIHueBlendMode" = "Uses the luminance and saturation values of the background with the hue of the source image.";"CILightenBlendMode" = "Creates composite image samples by choosing the lighter samples (either from the source image or the background). The result is that the background image samples are replaced by any source image samples that are lighter. Otherwise, the background image samples are left unchanged.";"CILuminosityBlendMode" = "Uses the hue and saturation of the background with the luminance of the source image. This mode creates an effect that is inverse to the effect created by the CIColorBlendMode filter.";"CIMultiplyBlendMode" = "Multiplies the source image samples with the background image samples. This results in colors that are at least as dark as either of the two contributing sample colors.";"CIOverlayBlendMode" = "Either multiplies or screens the source image samples with the background image samples, depending on the background color. The result is to overlay the existing image samples while preserving the highlights and shadows of the background. The background color mixes with the source image to reflect the lightness or darkness of the background.";"CISaturationBlendMode" = "Uses the luminance and hue values of the background with the saturation of the source image. Areas of the background that have no saturation (that is, pure gray areas) do not produce a change.";"CIScreenBlendMode" = "Multiplies the inverse of the source image samples with the inverse of the background image samples. This results in colors that are at least as light as either of the two contributing sample colors.";"CISoftLightBlendMode" = "Either darkens or lightens colors, depending on the source image sample color. If the source image sample color is lighter than 50% gray, the background is lightened, similar to dodging. If the source image sample color is darker than 50% gray, the background is darkened, similar to burning. If the source image sample color is equal to 50% gray, the background is not changed. Image samples that are equal to pure black or pure white produce darker or lighter areas, but do not result in pure black or white. The overall effect is similar to what you would achieve by shining a diffuse spotlight on the source image.";"outputImage" = "The image produced by a filter.";"inputBackgroundImage" = "The image to use as a background image.";"inputImage" = "The image to use as an input image. For filters that also use a background image, this is the foreground image.";"inputTime" = "The duration of the effect.";"inputTransform" = "A transformation to apply.";"inputScale" = "The amount of the effect.";"inputAspectRatio" = "An aspect ratio.";"inputCenter" = "The center of the area, as x and y coordinates, to filter.";"inputRadius" = "The distance from the center of the effect.";"inputAngle" = "An angle.";"inputRefraction" = "The index of refraction of the material (such as glass) used in the effect.";"inputWidth" = "The width of the effect.";"inputSharpness" = "The amount of sharpening to apply.";"inputIntensity" = "The intensity of the effect.";"inputEV" = "The number of F-stops brighter or darker to make the image.";"inputSaturation" = "The amount to adjust the saturation.";"inputColor" = "A color.";"inputBrightness" = "A brightness level.";"inputContrast" = "A contrast level.";"inputGradientImage" = "An environment map with alpha. Typically, this is an image contains highlight and shadow.";"inputMaskImage" = "A masking image.";"inputShadingImage" = "An environment map with alpha values. Typically this is an image contains highlight and shadow.";"inputTargetImage" = "The target image for a transition.";"inputExtent" = "A rectangle that defines the extent of the effect.";"CIBoxBlur.inputRadius" = "The radius determines how many pixels are used to create the blur. The larger the radius, the blurrier the result.";"CIDiscBlur.inputRadius" = "The radius determines how many pixels are used to create the blur. The larger the radius, the blurrier the result.";"CIGaussianBlur.inputRadius" = "The radius determines how many pixels are used to create the blur. The larger the radius, the blurrier the result.";"CIMotionBlur.inputRadius" ="The radius determines how many pixels are used to create the blur. The larger the radius, the blurrier the result.";"CIMotionBlur.inputAngle" = "The angle of the motion determines which direction the blur smears.";"CINoiseReduction.inputNoiseLevel" = "The amount of noise reduction. The larger the value, the more noise reduction.";"CINoiseReduction.inputSharpness" = "The sharpness of the final image. The larger the value, the sharper the result.";"CIZoomBlur.inputCenter" = "The x and y position to use as the center of the effect.";"CIZoomBlur.inputAmount" = "The zoom-in amount. Larger values result in more zooming in.";"CIColorControls.inputSaturation" = "The amount of saturation to apply. The larger the value, the more saturated the result.";"CIColorControls.inputBrightness" = "The amount of brightness to apply. The larger the value, the brighter the result.";"CIColorControls.inputContrast" = "The amount of contrast to apply. The larger the value, the more contrast in the resulting image.";"CIColorMatrix.inputRVector" = "The amount of red to multiply the source color values by.";"CIColorMatrix.inputGVector" = "The amount of green to multiply the source color values by.";"CIColorMatrix.inputBVector" = "The amount of blue to multiply the source color values by.";"CIColorMatrix.inputAVector" = "The amount of alpha to multiply the source color values by.";"CIColorMatrix.inputBiasVector" = "A vector that's added to each color component.";"CIExposureAdjust.inputEV" = "The amount to adjust the exposure of the image by. The larger the value, the brighter the exposure.";"CIGammaAdjust.inputPower" = "A gamma value to use to correct image brightness. The larger the value, the darker the result.";"CIHueAdjust.inputAngle" = "An angle (in degrees) to use to correct the hue of an image.";"CIWhitePointAdjust.inputColor" = "A color to use as the white point.";"CIColorCube.inputDimension" = "The dimension of the color table.";"CIColorCube.inputCubeData" = "This is a color table of floating-point RGBA cells that use premultiplied alpha. The cells are organized in a standard ordering. The columns and rows of the data are indexed by red and green, respectively. Each data plane is followed by the next higher plane in the data, with planes indexed by blue.";"CIColorMap.inputGradientImage" = "The image data from this image transforms the source image values.";"CIColorMonochrome.inputColor" = "The monochrome color to apply to the image.";"CIColorMonochrome.inputIntensity" = "The intensity of the monochrome effect. A value of 1.0 creates a monochrome image using the supplied color. A value of 0.0 has no effect on the image.";"CIColorPosterize.inputLevels" = "The number of brightness levels to use for each color component. Lower values result in a more extreme poster effect.";"CIFalseColor.inputColor0" = "The first color to use for the color ramp.";"CIFalseColor.inputColor1" = "The second color to use for the color ramp.";"CISepiaTone.inputIntensity" = "The intensity of the sepia effect. A value of 1.0 creates a monochrome sepia image. A value of 0.0 has no effect on the image.";"CIBumpDistortion.inputCenter" = "The x and y position to use as the center of the bump."; "CIBumpDistortion.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion."; "CIBumpDistortion.inputScale" = "The scale of the effect determines the curvature of the bump. A value of 0.0 has no effect. Positive values create an outward bump; negative values create an inward bump."; "CIBumpDistortionLinear.inputCenter" = "The x and y position to use as the center of the distortion."; "CIBumpDistortionLinear.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion.";  "CIBumpDistortionLinear.inputScale" = "The scale of the effect."; "CIBumpDistortionLinear.inputAngle" = "The angle (in degrees) of the line around which the distortion occurs."; "CICircleSplashDistortion.inputCenter" = "The x and y position to use as the center of the distortion.";  "CICircleSplashDistortion.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion.";  "CICircularWrap.inputCenter" = "The x and y position to use as the center of the distortion.";  "CICircularWrap.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion.";  "CICircularWrap.inputAngle" = "The angle of the effect."; "CIDisplacementDistortion.inputDisplacementImage" = "An image whose grayscale values will be applied to the source image."; "CIDisplacementDistortion.inputScale" = "The amount of texturing of the resulting image. The larger the value, the greater the texturing."; "CIGlassDistortion.inputTexture" = "A texture to apply to the source image.";"CIGlassDistortion.inputCenter" = "The x and y position to use as the center of the distortion."; "CIGlassDistortion.inputScale" = "The amount of texturing of the resulting image. The larger the value, the greater the texturing."; "CIGlassLozenge.inputPoint0" = "The x and y position that defines the center of the circle at one end of the lozenge."; "CIGlassLozenge.inputPoint1" = "The x and y position that defines the center of the circle at the other end of the lozenge.";  "CIGlassLozenge.inputRadius" = "The radius of the lozenge. The larger the radius, wider the extent of the distortion.";  "CIGlassLozenge.inputRefraction" = "The refraction of the glass."; "CIHoleDistortion.inputCenter" = "The x and y position to use as the center of the distortion.";  "CIHoleDistortion.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion.";  "CIPinchDistortion.inputCenter" = "The x and y position to use as the center of the distortion."; "CIPinchDistortion.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion."; "CIPinchDistortion.inputScale" = "The amount of pinching. A value of 0.0 has no effect. A value of 1.0 is the maximum pinch.";"CITorusLensDistortion.inputCenter" = "The x and y position to use as the center of the torus.";  "CITorusLensDistortion.inputRadius" = "The outer radius of the torus.";  "CITorusLensDistortion.inputWidth" = "The width of the ring."; "CITorusLensDistortion.inputRefraction" = "The refraction of the glass."; "CITwirlDistortion.inputCenter" = "The x and y position to use as the center of the distortion.";  "CITwirlDistortion.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion."; "CITwirlDistortion.inputAngle" = "The angle (in degrees) of the twirl. Values can be positive or negative.";"CIVortexDistortion.inputCenter" = "The x and y position to use as the center of the distortion."; "CIVortexDistortion.inputRadius" = "The radius determines how many pixels are used to create the distortion. The larger the radius, wider the extent of the distortion."; "CIVortexDistortion.inputAngle" = "The angle (in degrees) of the vortex.";"CICheckerboardGenerator.inputColor0" = "A color to use for the first set of the checkerboard squares.";"CICheckerboardGenerator.inputColor1" = "A color to use for the second set of the checkerboard squares.";"CICheckerboardGenerator.inputWidth" = "The width of a square in the checkerboard pattern.";"CICheckerboardGenerator.inputSharpness" = "The sharpness of the checkerboard pattern. The smaller the value, the more blurry the pattern. Values range from 0.0 to 1.0.";"CIConstantColorGenerator.inputColor" = "The color to generate."; "CILenticularHaloGenerator.inputCenter" = "The x and y position to use as the center of the halo.";"CILenticularHaloGenerator.inputHaloRadius" = "The radius of the halo.";"CILenticularHaloGenerator.inputHaloWidth" = "The width if the halo, from its inner radius to its outer radius.";"CILenticularHaloGenerator.inputOverlap" = "The amount of overlap of the diffraction components of the halo. A value of 1.0 is complete overlap; the halo is white. A value of 0.0 is no overlap; halo colors do not overlap.";"CILenticularHaloGenerator.inputStriationStrength" = "The intensity of the halo colors. Larger values are more intense.";"CILenticularHaloGenerator.inputStriationContrast" = "The contrast of the halo colors. Larger values are higher contrast.";"CIStarShineGenerator.inputCenter" = "The  x and y position to use as the center of the star."; "CIStarShineGenerator.inputColor" = "The color to use for the outer shell of the circular star."; "CIStarShineGenerator.inputRadius" = "The radius of the star."; "CIStarShineGenerator.inputCrossScale" = "The size of the cross pattern."; "CIStarShineGenerator.inputCrossAngle" = "The angle of the cross pattern."; "CIStarShineGenerator.inputCrossOpacity" = "The opacity of the cross pattern."; "CIStarShineGenerator.inputCrossWidth" = "The width of the cross pattern."; "CIStarShineGenerator.inputEpsilon" = "The length of the cross spikes."; "CIStripesGenerator.inputCenter" = "The x and y position to use as the center of the stripe pattern."; "CIStripesGenerator.inputColor0" = "A color to use for the odd stripes."; "CIStripesGenerator.inputColor1" = "A color to use for the even stripes.";"CIStripesGenerator.inputWidth" = "The width of a stripe."; "CIStripesGenerator.inputSharpness" = "The sharpness of the stripe pattern. The smaller the value, the more blurry the pattern. Values range from 0.0 to 1.0."; "CISunbeamsGenerator.inputCenter" = "The  x and y position to use as the center of the sunbeam pattern";"CISunbeamsGenerator.inputColor" = "The color of the sun.";"CISunbeamsGenerator.inputSunRadius" = "The radius of the sun.";"CISunbeamsGenerator.inputMaxStriationRadius" = "The radius of the sunbeams.";"CISunbeamsGenerator.inputStriationStrength" = "The intensity of the sunbeams. Higher values result in more intensity.";"CISunbeamsGenerator.inputStriationContrast" = "The contrast of the sunbeams. Higher values result in more contrast.";"CIAffineTransform.inputTransform" = "A transform to apply to the image."; "CICrop.inputRectangle" = "The rectangle that specifies the crop to apply to the image."; "CILanczosScaleTransform.inputScale" = "The scaling factor to use on the image. Values less than 1.0 scale down the images. Values greater than 1.0 scale up the image."; "CILanczosScaleTransform.inputAspectRatio" = "The aspect ratio of the image."; "CIPerspectiveTransform.inputTopLeft" = "The top left coordinate to map the image to."; "CIPerspectiveTransform.inputTopRight" = "The top right coordinate to map the image to."; "CIPerspectiveTransform.inputBottomRight" = "The bottom right coordinate to map the image to."; "CIPerspectiveTransform.inputBottomLeft" = "The bottom left coordinate to map the image to."; "CIGaussianGradient.inputColor0" = "The first color to use in the gradient."; "CIGaussianGradient.inputColor1" = "The second color to use in the gradient."; "CIGaussianGradient.inputRadius" = "The radius of the Gaussian distribution."; "CILinearGradient.inputPoint0" = "The starting position of the gradient -- where the first color begins."; "CILinearGradient.inputPoint1" = "The ending position of the gradient -- where the sedon color begins."; "CILinearGradient.inputColor0" = "The first color to use in the gradient.";  "CILinearGradient.inputColor1" = "The second color to use in the gradient.";  "CIRadialGradient.inputRadius0" = "The radius of the starting circle to use in the gradient.";"CIRadialGradient.inputRadius1" = "The radius of the ending circle to use in the gradient.";"CIRadialGradient.inputColor0" = "The first color to use in the gradient.";  "CIRadialGradient.inputColor1" = "The second color to use in the gradient."; "CICircularScreen.inputCenter" = "The x and y position to use as the center of the circular screen pattern"; "CICircularScreen.inputWidth" = "The distance between each circle in the pattern."; "CICircularScreen.inputSharpness" = "The sharpness of the circles. The larger the value, the sharper the circles."; "CICMYKHalftone.inputCenter" = "The x and y position to use as the center of the halftone pattern";  "CICMYKHalftone.inputWidth" = "The distance between dots in the pattern."; "CICMYKHalftone.inputAngle" = "The angle of the pattern."; "CICMYKHalftone.inputSharpness" = "The sharpness of the pattern.The larger the value, the sharper the pattern."; "CICMYKHalftone.inputGCR" = "The gray component replacement value. The value can vary from 0.0 (none) to 1.0."; "CICMYKHalftone.inputUCR" = "The under color removal value. The value can vary from 0.0 to 1.0. "; "CIDotScreen.inputCenter" = "The x and y position to use as the center of the dot screen pattern";  "CIDotScreen.inputAngle" = "The angle of the pattern."; "CIDotScreen.inputWidth" = "The distance between dots in the pattern."; "CIDotScreen.inputSharpness" = "The sharpness of the pattern.The larger the value, the sharper the pattern."; "CIHatchedScreen.inputCenter" = "The x and y position to use as the center of the hatched screen pattern"; "CIHatchedScreen.inputAngle" = "The angle of the pattern.";"CIHatchedScreen.inputWidth" = "The distance between lines in the pattern."; "CIHatchedScreen.inputShaprness" = "The sharpness of the pattern.The larger the value, the sharper the pattern."; "CILineScreen.inputCenter" = "The x and y position to use as the center of the line screen pattern";  "CILineScreen.inputAngle" = "The angle of the pattern."; "CILineScreen.inputWidth" = "The distance between lines in the pattern."; "CILineScreen.inputSharpness" = "The sharpness of the pattern.The larger the value, the sharper the pattern."; 	"CISharpenLuminance.inputSharpness" = "The amount of sharpening to apply. Larger values are sharper.";"CIUnsharpMask.inputRadius" = "The radius around a given pixel to apply the unsharp mask. The larger the radius, the more of the image is affected.";"CIUnsharpMask.inputIntensity" = "The intensity of the effect. The larger the value, the more contrast in the affected area.";"CIBlendWithMask.inputMaskImage" = "A grayscale mask. When a mask value is 0.0, the result is the background. When the mask value is 1.0, the result is the image."; "CIBloom.inputRadius" = "The radius determines how many pixels are used to create the effect. The larger the radius, the greater the effect.";"CIBloom.inputIntensity" = "The intensity of the effect. A value of 0.0 is no effect. A value of 1.0 is the maximum effect."; "CICrystallize.inputRadius" = "The radius determines how many pixels are used to create the effect. The larger the radius, the larger the resulting crystals."; "CIEdges.inputIntensity" = "The intensity of the edges. The larger the value, the higher the intensity."; "CIEdgeWork.inputRadius" = "The thickness of the edges. The larger the value, the thicker the edges."; "CIGloom.inputRadius" = "The radius determines how many pixels are used to create the effect. The larger the radius, the greater the effect."; "CIGloom.inputIntensity" = "The intensity of the effect. A value of 0.0 is no effect. A value of 1.0 is the maximum effect."; "CIHeightFieldFromMask.inputImage" = "The white values of the mask define those pixels that are inside the height field while the black values define those pixels that are outside. The field varies smoothly and continuously inside the mask, reaching the value 0 at the edge of the mask."; "CIHeightFieldFromMask.inputRadius" = "The distance from the edge of the mask for the smooth transition is proportional to the input radius. Larger values make the transition smoother and more pronounced. Smaller values make the transition approximate a fillet radius."; "CIHexagonalPixellate.inputCenter" = "The x and y position to use as the center of the effect"; "CIHexagonalPixellate.inputScale" = "The scale determines the size of the hexagons. Larger values result in larger hexagons."; "CILineOverlay.inputNRNoiseLevel" = "The noise level of the image (used with camera data) that gets removed before tracing the edges of the image. Increasing the noise level helps to clean up the traced edges of the image."; "CILineOverlay.inputNRSharpness" = "The amount of sharpening done when removing noise in the image before tracing the edges of the image. This improves the edge acquisition."; "CILineOverlay.inputEdgeIntensity" = "The accentuation factor of the Sobel gradient information when tracing the edges of the image. Higher values find more edges, although typically a low value (such as 1.0) is used."; "CILineOverlay.inputThreshold" = "This value determines edge visitility. Larger values  thinn out the edges."; "CILineOverlay.inputContrast" = "The amount of anti-aliasing to use on the edges produced by this filter. Higher values produce higher contrast edges (they are less anti-aliased)."; "CIPixellate.inputCenter" = "The x and y position to use as the center of the effect";  "CIPixellate.inputScale" = "The scale determines the size of the squares. Larger values result in larger squares."; "CIPointillize.inputRadius" = "The radius of the circles in the resulting pattern."; "CIPointillize.inputCenter" = "The x and y position to use as the center of the effect";  "CIShadedMaterial.inputShadingImage" = "The image to use as the height field. The resulting image has greater heights with lighter shades, and lesser heights (lower areas) with darker shades."; "CIShadedMaterial.inputScale" = "THe scale of the effect. The higher the value, the more dramatic the effect."; "CISpotColor.inputCenterColor1" = "The center value of the first color range to replace."; "CISpotColor.inputReplacementColor1" = "A replacement color for the first color range."; "CISpotColor.inputCloseness1" = "A value that indicates how close the first color must match before it is replaced."; "CISpotColor.inputContrast1" = "The contrast of the first replacement color."; "CISpotColor.inputCenterColor2" = "The center value of the second color range to replace."; "CISpotColor.inputReplacementColor2" = "A replacement color for the second color range.";"CISpotColor.inputCloseness2" = "A value that indicates how close the second color must match before it is replaced."; "CISpotColor.inputContrast2" = "The contrast of the second replacement color."; "CISpotColor.inputCenterColor3" = "The center value of the third color range to replace.";  "CISpotColor.inputReplacementColor3" = "A replacement color for the third color range."; "CISpotColor.inputCloseness3" = "A value that indicates how close the third color must match before it is replaced.";  "CISpotColor.inputContrast3" = "The contrast of the third replacement color.";  "CISpotLight.inputLightPosition" = "The x and y position of the spotlight."; 		"CISpotLight.inputLightPointsAt" = "The x and y position that the spotlight points at.";  "CISpotLight.inputBrightness" = "The brightness of the spotlight."; "CISpotLight.inputConcentration" = "The spotlight size. The smaller the value, the more tightly focused the light beam."; "CISpotLight.inputColor" = "The color of the spotlight."; "CIAffineClamp.inputTransform" = "The transform to apply to the image."; "CIAffineTile.inputTransform" = "The transform to apply to the image."; "CIEightfoldReflectedTile.inputCenter" = "The x and y position to use as the center of the effect";  "CIEightfoldReflectedTile.inputAngle" = "The angle (in degrees) of the tiled pattern."; "CIEightfoldReflectedTile.inputWidth" = "The width of a tile."; "CIFourfoldReflectedTile.inputCenter" = "The x and y position to use as the center of the effect";  "CIFourfoldReflectedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "The primary angle for the repeating reflected tile. Small values create thin diamond tiles, and higher values create fatter reflected tiles."; "CIFourfoldReflectedTile.inputWidth" = "The width of a tile.";  "CIFourfoldRotatedTile.inputCenter" = "The x and y position to use as the center of the effect";  "CIFourfoldRotatedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CIFourfoldRotatedTile.inputWidth" = "The width of a tile."; "CIFourfoldTranslatedTile.inputCenter" = "The x and y position to use as the center of the effect";  "CIFourfoldTranslatedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "The primary angle for the repeating translated tile. Small values create thin diamond tiles, and higher values create fatter translated tiles."; "CIFourfoldTranslatedTile.inputWidth" = "The width of a tile.";  "CIGlideReflectedTile.inputCenter" = "The x and y position to use as the center of the effect";  "CIGlideReflectedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CIGlideReflectedTile.inputWidth" = "The width of a tile.";  "CIKaleidoscope.inputCount" = "The number of relections in the pattern."; "CIKaleidoscope.inputCenter" = "The x and y position to use as the center of the effect";  "CIKaleidoscope.inputAngle" = "The angle of reflection."; "CIOpTile.inputCenter" = "The x and y position to use as the center of the effect";  "CIOpTile.inputScale" = "The scale determines the number of tiles in the effect."; "CIOpTile.inputAngle" = "The angle of a tile."; "CIOpTile.inputWidth" = "The width of a tile."; "CIParallelogramTile.inputCenter" = "The x and y position to use as the center of the effect"; "CIParallelogramTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CIParallelogramTile.inputAcuteAngle" = "The primary angle for the repeating parallelogram tile. Small values create thin diamond tiles, and higher values create fatter parallelogram tiles."; "CIParallelogramTile.inputWidth" = "The width of a tile.";  "CIPerspectiveTile.inputTopLeft" = "The top left coordinate of a tile."; "CIPerspectiveTile.inputTopRight" = "The top right coordinate of a tile.";"CIPerspectiveTile.inputBottomRight" = "The bottom right coordinate of a tile."; "CIPerspectiveTile.inputBottomLeft" = "The bottom left coordinate of a tile."; "CISixfoldReflectedTile.inputCenter" = "The x and y position to use as the center of the effect";  "CISixfoldReflectedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CISixfoldReflectedTile.inputWidth" = "The width of a tile."; "CISixfoldRotatedTile.inputCenter" = "The x and y position to use as the center of the effect"; "CISixfoldRotatedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CISixfoldRotatedTile.inputWidth" = "The width of a tile.";  "CITriangleTile.inputCenter" = "The x and y position to use as the center of the effect";  "CITriangleTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";  "CITriangleTile.inputWidth" = "The width of a tile.";  "CITwelvefoldReflectedTile.inputCenter" = "The x and y position to use as the center of the effect"; "CITwelvefoldReflectedTile.inputAngle" = "The angle (in degrees) of the tiled pattern.";"CITwelvefoldReflectedTile.inputWidth" = "The width of a tile."; "CIBarsSwipeTransition.inputAngle" = "The angle (in degrees) of the bars.";	"CIBarsSwipeTransition.inputWidth" = "The width of each bar.";	"CIBarsSwipeTransition.inputBarOffset" = "The offset of one bar with respect to another";	"CIBarsSwipeTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CICopyMachineTransition.inputColor" = "The color of the copier light.";"CICopyMachineTransition.inputAngle" = "The angle of the copier light.";"CICopyMachineTransition.inputWidth" = "The width of the copier light. ";"CICopyMachineTransition.inputOpacity" = "The opacity of the copier light. A value of 0.0 is transparent. A value of 1.0 is opaque.";"CICopyMachineTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "An image that defines the shape to use when disintegrating from the source to the target image.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "The radius of the shadow created by the mask.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "The density of the shadow created by the mask.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "The offset of the shadow created by the mask.";"CIDisintegrateWithMaskTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIDissolveTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIFlashTransition.inputCenter" = "The x and y position to use as the center of the effect"; "CIFlashTransition.inputExtent" = "The extent of the flash.";"CIFlashTransition.inputColor" = "The color of the light rays emanating from the flash.";"CIFlashTransition.inputMaxStriationRadius" = "The radius of the light rays emanating from the flash.";"CIFlashTransition.inputStriationStrength" = "The strength light rays emanating from the flash.";"CIFlashTransition.inputStriationContrast" = "The contrast of the light rays emanating from the flash.";"CIFlashTransition.inputFadeThreshold" = "The amount of fade between the flash and the target image. The higher the value, the more flash time and the less fade time.";"CIFlashTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIModTransition.inputCenter" = "The x and y position to use as the center of the effect"; "CIModTransition.inputAngle" = "The angle of the mod hole pattern.";"CIModTransition.inputRadius" = "The radius of the undistorted holes in the pattern.";"CIModTransition.inputCompression" = "The amount of stretching applied to the mod hole pattern. Holes in the center are not distorted as much as those at the edge of the image.";"CIModTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIPageCurlTransition.inputBacksideImage" = "The image that appears on the back of the source image, as the page curls to reveal the target image.";"CIPageCurlTransition.inputShadingImage" = "An image that looks like a shaded sphere enclosed in a square image.";"CIPageCurlTransition.inputExtent" = "The extent of the effect.";"CIPageCurlTransition.inputAngle" = "The angle of the curling page.";"CIPageCurlTransition.inputRadius" = "The radius of the curl.";"CIPageCurlTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIRippleTransition.inputShadingImage" = "An image that looks like a shaded sphere enclosed in a square image.";"CIRippleTransition.inputCenter" = "The x and y position to use as the center of the effect"; "CIRippleTransition.inputExent" = "The extent of the effect.";"CIRippleTransition.inputWidth" = "The width of the ripple.";"CIRippleTransition.inputScale" = "A value that determines whether the ripple starts as a bulge (higher value) or a dimple (lower value).";"CIRippleTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CISwipeTransition.inputExtent" = "The extent of the effect.";"CISwipeTransition.inputColor" = "The color of the swipe.";"CISwipeTransition.inputAngle" = "The angle of the swipe.";"CISwipeTransition.inputWidth" = "The width of the swipe";"CISwipeTransition.inputOpacity" = "The opacity of the swipe.";"CISwipeTransition.inputTime" = "The parametric time of the transition. This value drives the transition from start (at time 0) to end (at time 1).";"CIAreaHistogram" = "Calculates a histogram for the specified area in an image, returning the result in a 1D image.";"CIAreaHistogram.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIAreaHistogram.inputCount" = "The number of bins for the histogram.";"CIAreaHistogram.inputImage" = "The image whose histogram you want to calculate.";"CIAreaHistogram.inputScale" = "The scale value to use for the histogram values.";"CIAreaMaximum" = "Calculates the maximum component values for the specified area in an image, returning the result in a pixel.";"CIAreaMaximum.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIAreaMaximum.inputImage" = "The image to process.";"CIAreaMinimum" = "Calculates the minimum component values for the specified area in an image, returning the result in a pixel.";"CIAreaMinimum.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIAreaMinimum.inputImage" = "The image to process.";"CIAreaMaximumAlpha" = "Finds and returns the pixel with the maximum alpha value.";"CIAreaMaximumAlpha.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIAreaMaximumAlpha.inputImage" = "The image to process.";"CIAreaMinimumAlpha" = "Finds and returns the pixel with the minimum alpha value.";"CIAreaMinimumAlpha.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIAreaMinimumAlpha.inputImage" = "The image to process.";"CIAreaAverage" = "Calculates the average color for the specified area in an image, returning the result in a pixel.";"CIAreaAverage.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIAreaAverage.inputImage" = "The image to process.";"CIRowAverage" = "Calculates the average color for each row of the specified area in an image, returning the result in a 1D image.";"CIRowAverage.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIRowAverage.inputImage" = "The image to process.";"CIColumnAverage" = "Calculates the average color for each column of the specified area in an image, returning the result in a 1D image.";"CIColumnAverage.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIColumnAverage.inputImage" = "The image to process.";"CIMinimumComponent" = "Converts an image to grayscale using the minimum of the three color components.";"CIMinimumComponent.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIMinimumComponent.inputImage" = "The image to process.";"CIMaximumComponent" = "Converts an image to grayscale using the maximum of the three color components.";"CIMaximumComponent.inputExtent" = "A rectangle that specifies the subregion of the image that you want to process.";"CIMaximumComponent.inputImage" = "The image to process.";